#************************************************************************
#************************************************************************
#******************下面是程序一些使用说明********************************
#******************************************2023.10.3*********************

# ../111.sh  # ccfull批处理

timeStart=$(date +%s)

rm ./fig/*
rm *.txt

./result.sh | tee chi2.txt  # 计算chi2,并输入到文件chi2.txt,同时绘制了实验值和理论值的图像，位于/fig/中

./chi2_sort.sh ./chi2.txt 1 > chi2_sort.txt  # chi^2排序，第一个参数是输入文件，第二个参数表示按照偶数行进行排序

timeEnd=$(date +%s)
time=$((timeEnd-timeStart))
echo "程序运行了 $time s"

